niklauslee/pixwatch-backup-nrf52/src/main.c
#define RX_PIN_NUMBER  8
#define TX_PIN_NUMBER  6
#define CTS_PIN_NUMBER 7
#define RTS_PIN_NUMBER 5

#define BUTTON_DEBOUNCE_DELAY			50


static uint16_t m_conn_handle               = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */

static ble_db_discovery_t        m_ble_db_discovery;                   /**< Structure used to identify the DB Discovery module. */
static ble_pixwatch_c_t          m_pixwatch;                           /**< Structure to store the data of the pixwatch service. */
static dm_application_instance_t m_app_handle;                         /**< Application identifier allocated by the Device Manager. */
static dm_handle_t               m_peer_handle;                        /**< The peer that is currently connected. */

static app_timer_id_t m_sec_req_timer_id;                              /**< Security request timer. */
static app_timer_id_t m_realtime_timer_id;                             /**< Real-time timer */

#define SCHED_MAX_EVENT_DATA_SIZE sizeof(app_timer_event_t)            /**< Maximum size of scheduler events. Note that scheduler BLE stack events do not contain any data, as the events are being pulled from the stack in the event handler. */
#define SCHED_QUEUE_SIZE          10                                   /**< Maximum number of events in the scheduler queue. */

static ble_uuid_t m_adv_uuids[] = {{PIXWATCH_UUID_SERVICE, BLE_UUID_TYPE_VENDOR_BEGIN}}; /**< Universally unique service identifiers. */

/* Current Time */
time_t current_time = 0;


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num  Line number of the failing ASSERT call.
 * @param[in] file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling the Current Time Service errors.
 *
 * @param[in]  nrf_error  Error code containing information about what went wrong.
 */
static void current_time_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling UART errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
    else if (p_event->evt_type == APP_UART_DATA_READY) // There is one byte in the RX FIFO.
    {
    	uint8_t character;
    	while(app_uart_get(&character) != NRF_SUCCESS); // Non blocking.
        while(app_uart_put(character) != NRF_SUCCESS); // Non blocking.
    	// jshPushIOCharEvent(EV_SERIAL1, (char) character);
    }
}

static void on_pixwatch_c_evt(ble_pixwatch_c_t * p_pixwatch, ble_pixwatch_c_evt_t * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_PIXWATCH_C_EVT_DISCOVERY_COMPLETE:
            printf("Current Time Service discovered on server.\n");
            break;

        case BLE_PIXWATCH_C_EVT_SERVICE_NOT_FOUND:
            printf("Current Time Service not found on server.\n");
            break;

        case BLE_PIXWATCH_C_EVT_DISCONN_COMPLETE:
            printf("Disconnect Complete.\n");
            break;

        case BLE_PIXWATCH_C_EVT_LOCAL_TIME:
            printf("Current Time received.\n");
            current_time = p_evt->local_time;
            break;

        default:
            break;
    }
}


static void pixwatch_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the security request timer time-out.
 *
 * @details This function will be called each time the security request timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the time-out handler.
 */
static void sec_req_timeout_handler(void * p_context)
{
    uint32_t             err_code;
    dm_security_status_t status;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        err_code = dm_security_status_req(&m_peer_handle, &status);
        APP_ERROR_CHECK(err_code);

        // If the link is still not secured by the peer, initiate security procedure.
        if (status == NOT_ENCRYPTED)
        {
            err_code = dm_security_setup_req(&m_peer_handle);
            APP_ERROR_CHECK(err_code);
        }
    }
}


static void button_handler(uint8_t pin_no, uint8_t button_action)
{
    if(button_action == APP_BUTTON_PUSH)
    {
    	uint32_t err_code;
    	struct tm *t;

        switch(pin_no)
        {
            case BUTTON_1:
                if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
                {
                    err_code = ble_pixwatch_c_local_time_read(&m_pixwatch);
                    if (err_code == NRF_ERROR_NOT_FOUND)
                    {
                        printf("Current Time Service is not discovered.\r\n");
                    }
                }
                break;

            case BUTTON_2:
            	t = localtime(&current_time);
                printf("Local Time (Unix Time + Local Offset): %d\n", (int) current_time);
                printf("Year: %d\n",   t->tm_year + 1900);
                printf("Month: %d\n",   t->tm_mon + 1);
                printf("Day: %d\n", t->tm_mday);
                printf("Hour: %d\n",   t->tm_hour);
                printf("Minute: %d\n",   t->tm_min);
                printf("Second: %d\n", t->tm_sec);
                printf("Day of Week: %d\n", t->tm_wday); // Sun=0, Mon=1, Tue=2, Wed=3, Thu=4, Fri=5, Sat=6
                break;

            case BUTTON_3:
            	printf("button_3 pressed.\n");
                break;

