niklauslee/pixwatch-backup-nrf52/src/main.c
    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


static void buttons_init(void) {
	uint32_t err_code;

	static app_button_cfg_t p_button[] = {
			{BUTTON_1, false, NRF_GPIO_PIN_PULLUP, button_handler},
	        {BUTTON_2, false, NRF_GPIO_PIN_PULLUP, button_handler},
	        {BUTTON_3, false, NRF_GPIO_PIN_PULLUP, button_handler},
	        {BUTTON_4, false, NRF_GPIO_PIN_PULLUP, button_handler}
	};

    err_code = app_button_init(p_button, sizeof(p_button) / sizeof(p_button[0]), BUTTON_DEBOUNCE_DELAY);
    APP_ERROR_CHECK(err_code);

    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the UART.
 */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        0xFF, // UART_PIN_DISCONNECTED
        0xFF, // UART_PIN_DISCONNECTED
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud38400
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_error_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}


/**
 * @brief Database discovery collector initialization.
 */
static void db_discovery_init(void)
{
    uint32_t err_code = ble_db_discovery_init();

    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds = false;

    // Initialize
    app_trace_init();
    timers_init();
    buttons_init();
    uart_init();
    printf("PixWatch Starting!\n");
    ble_stack_init();
    device_manager_init(erase_bonds);
    db_discovery_init();
    scheduler_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    printf("Advertising Started!\n");

    // Init display
    spi_master_init();
    initDisplay();
    drawRectangle(0, 0, 127, 95, BLACK);

    // espruino
    jshInit();
    jsvInit();
    jsiInit(false);
    

    // Enter main loop
    for (;;)
    {
        app_sched_execute();
        power_manage();
    }
}


/**
 * @}
 */
